Revit 2027 API
ParameterTypeId.RbsElecCircuitConnectionTypeParam Property
 "Connection Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RbsElecCircuitConnectionTypeParam { get; }
Public Shared ReadOnly Property RbsElecCircuitConnectionTypeParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RbsElecCircuitConnectionTypeParam {
	ForgeTypeId^ get ();
}
static member RbsElecCircuitConnectionTypeParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace